#1
a = [1, 2, 3]
b = a
c = a.copy()

b[0] = 100
c[1] = 200 #別の変数

print(a) #[100, 200, 3]

#2
a = [[1, 2], [3, 4]]
b = a.copy() #shallow copy
c = a 

b[0][1] = 99
c[1] = [100, 200] #cとaは同じ変数なので入れ替えてもaに影響がでる

print(a) #[[1, 99],[3, 4]]　答え[1, 99],[100,200]

#3
a = [[0]*3]*3 #[[0,0,0]]*3
a[0][1] = 9
print(a) #[0, 9, 0], [0, 0, 0],[0, 0, 0]　答え　[0, 9, 0],[0, 9, 0],[0, 9, 0]

#4
a = [0, 0, 0]
list = []
for list in a:
    if a * 3:
        print(list)

#4答え
a = []

for _ in range(3):
    a.append([0] * 3)

print(a)